; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos) 
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-9-9-2-4-4)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos0-5 pos0-6 pos0-7 pos0-8 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos1-5 pos1-6 pos1-7 pos1-8 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5 pos2-6 pos2-7 pos2-8 pos3-0 pos3-1 pos3-2 pos3-3 pos3-4 pos3-5 pos3-6 pos3-7 pos3-8 pos4-0 pos4-1 pos4-2 pos4-3 pos4-4 pos4-5 pos4-6 pos4-7 pos4-8 pos5-0 pos5-1 pos5-2 pos5-3 pos5-4 pos5-5 pos5-6 pos5-7 pos5-8 pos6-0 pos6-1 pos6-2 pos6-3 pos6-4 pos6-5 pos6-6 pos6-7 pos6-8 pos7-0 pos7-1 pos7-2 pos7-3 pos7-4 pos7-5 pos7-6 pos7-7 pos7-8 pos8-0 pos8-1 pos8-2 pos8-3 pos8-4 pos8-5 pos8-6 pos8-7 pos8-8
    shape0 shape1
    key0 key1 key2 key3
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos0-5)
       (place pos0-6)
       (place pos0-7)
       (place pos0-8)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos1-5)
       (place pos1-6)
       (place pos1-7)
       (place pos1-8)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (place pos2-5)
       (place pos2-6)
       (place pos2-7)
       (place pos2-8)
       (place pos3-0)
       (place pos3-1)
       (place pos3-2)
       (place pos3-3)
       (place pos3-4)
       (place pos3-5)
       (place pos3-6)
       (place pos3-7)
       (place pos3-8)
       (place pos4-0)
       (place pos4-1)
       (place pos4-2)
       (place pos4-3)
       (place pos4-4)
       (place pos4-5)
       (place pos4-6)
       (place pos4-7)
       (place pos4-8)
       (place pos5-0)
       (place pos5-1)
       (place pos5-2)
       (place pos5-3)
       (place pos5-4)
       (place pos5-5)
       (place pos5-6)
       (place pos5-7)
       (place pos5-8)
       (place pos6-0)
       (place pos6-1)
       (place pos6-2)
       (place pos6-3)
       (place pos6-4)
       (place pos6-5)
       (place pos6-6)
       (place pos6-7)
       (place pos6-8)
       (place pos7-0)
       (place pos7-1)
       (place pos7-2)
       (place pos7-3)
       (place pos7-4)
       (place pos7-5)
       (place pos7-6)
       (place pos7-7)
       (place pos7-8)
       (place pos8-0)
       (place pos8-1)
       (place pos8-2)
       (place pos8-3)
       (place pos8-4)
       (place pos8-5)
       (place pos8-6)
       (place pos8-7)
       (place pos8-8)
       (shape shape0)
       (shape shape1)
       (key key0)
       (key key1)
       (key key2)
       (key key3)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-5)
       (conn pos0-4 pos0-3)
       (conn pos0-5 pos1-5)
       (conn pos0-5 pos0-6)
       (conn pos0-5 pos0-4)
       (conn pos0-6 pos1-6)
       (conn pos0-6 pos0-7)
       (conn pos0-6 pos0-5)
       (conn pos0-7 pos1-7)
       (conn pos0-7 pos0-8)
       (conn pos0-7 pos0-6)
       (conn pos0-8 pos1-8)
       (conn pos0-8 pos0-7)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos1-5)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos1-5 pos2-5)
       (conn pos1-5 pos1-6)
       (conn pos1-5 pos0-5)
       (conn pos1-5 pos1-4)
       (conn pos1-6 pos2-6)
       (conn pos1-6 pos1-7)
       (conn pos1-6 pos0-6)
       (conn pos1-6 pos1-5)
       (conn pos1-7 pos2-7)
       (conn pos1-7 pos1-8)
       (conn pos1-7 pos0-7)
       (conn pos1-7 pos1-6)
       (conn pos1-8 pos2-8)
       (conn pos1-8 pos0-8)
       (conn pos1-8 pos1-7)
       (conn pos2-0 pos3-0)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos3-1)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos3-2)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos3-3)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos3-4)
       (conn pos2-4 pos2-5)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (conn pos2-5 pos3-5)
       (conn pos2-5 pos2-6)
       (conn pos2-5 pos1-5)
       (conn pos2-5 pos2-4)
       (conn pos2-6 pos3-6)
       (conn pos2-6 pos2-7)
       (conn pos2-6 pos1-6)
       (conn pos2-6 pos2-5)
       (conn pos2-7 pos3-7)
       (conn pos2-7 pos2-8)
       (conn pos2-7 pos1-7)
       (conn pos2-7 pos2-6)
       (conn pos2-8 pos3-8)
       (conn pos2-8 pos1-8)
       (conn pos2-8 pos2-7)
       (conn pos3-0 pos4-0)
       (conn pos3-0 pos3-1)
       (conn pos3-0 pos2-0)
       (conn pos3-1 pos4-1)
       (conn pos3-1 pos3-2)
       (conn pos3-1 pos2-1)
       (conn pos3-1 pos3-0)
       (conn pos3-2 pos4-2)
       (conn pos3-2 pos3-3)
       (conn pos3-2 pos2-2)
       (conn pos3-2 pos3-1)
       (conn pos3-3 pos4-3)
       (conn pos3-3 pos3-4)
       (conn pos3-3 pos2-3)
       (conn pos3-3 pos3-2)
       (conn pos3-4 pos4-4)
       (conn pos3-4 pos3-5)
       (conn pos3-4 pos2-4)
       (conn pos3-4 pos3-3)
       (conn pos3-5 pos4-5)
       (conn pos3-5 pos3-6)
       (conn pos3-5 pos2-5)
       (conn pos3-5 pos3-4)
       (conn pos3-6 pos4-6)
       (conn pos3-6 pos3-7)
       (conn pos3-6 pos2-6)
       (conn pos3-6 pos3-5)
       (conn pos3-7 pos4-7)
       (conn pos3-7 pos3-8)
       (conn pos3-7 pos2-7)
       (conn pos3-7 pos3-6)
       (conn pos3-8 pos4-8)
       (conn pos3-8 pos2-8)
       (conn pos3-8 pos3-7)
       (conn pos4-0 pos5-0)
       (conn pos4-0 pos4-1)
       (conn pos4-0 pos3-0)
       (conn pos4-1 pos5-1)
       (conn pos4-1 pos4-2)
       (conn pos4-1 pos3-1)
       (conn pos4-1 pos4-0)
       (conn pos4-2 pos5-2)
       (conn pos4-2 pos4-3)
       (conn pos4-2 pos3-2)
       (conn pos4-2 pos4-1)
       (conn pos4-3 pos5-3)
       (conn pos4-3 pos4-4)
       (conn pos4-3 pos3-3)
       (conn pos4-3 pos4-2)
       (conn pos4-4 pos5-4)
       (conn pos4-4 pos4-5)
       (conn pos4-4 pos3-4)
       (conn pos4-4 pos4-3)
       (conn pos4-5 pos5-5)
       (conn pos4-5 pos4-6)
       (conn pos4-5 pos3-5)
       (conn pos4-5 pos4-4)
       (conn pos4-6 pos5-6)
       (conn pos4-6 pos4-7)
       (conn pos4-6 pos3-6)
       (conn pos4-6 pos4-5)
       (conn pos4-7 pos5-7)
       (conn pos4-7 pos4-8)
       (conn pos4-7 pos3-7)
       (conn pos4-7 pos4-6)
       (conn pos4-8 pos5-8)
       (conn pos4-8 pos3-8)
       (conn pos4-8 pos4-7)
       (conn pos5-0 pos6-0)
       (conn pos5-0 pos5-1)
       (conn pos5-0 pos4-0)
       (conn pos5-1 pos6-1)
       (conn pos5-1 pos5-2)
       (conn pos5-1 pos4-1)
       (conn pos5-1 pos5-0)
       (conn pos5-2 pos6-2)
       (conn pos5-2 pos5-3)
       (conn pos5-2 pos4-2)
       (conn pos5-2 pos5-1)
       (conn pos5-3 pos6-3)
       (conn pos5-3 pos5-4)
       (conn pos5-3 pos4-3)
       (conn pos5-3 pos5-2)
       (conn pos5-4 pos6-4)
       (conn pos5-4 pos5-5)
       (conn pos5-4 pos4-4)
       (conn pos5-4 pos5-3)
       (conn pos5-5 pos6-5)
       (conn pos5-5 pos5-6)
       (conn pos5-5 pos4-5)
       (conn pos5-5 pos5-4)
       (conn pos5-6 pos6-6)
       (conn pos5-6 pos5-7)
       (conn pos5-6 pos4-6)
       (conn pos5-6 pos5-5)
       (conn pos5-7 pos6-7)
       (conn pos5-7 pos5-8)
       (conn pos5-7 pos4-7)
       (conn pos5-7 pos5-6)
       (conn pos5-8 pos6-8)
       (conn pos5-8 pos4-8)
       (conn pos5-8 pos5-7)
       (conn pos6-0 pos7-0)
       (conn pos6-0 pos6-1)
       (conn pos6-0 pos5-0)
       (conn pos6-1 pos7-1)
       (conn pos6-1 pos6-2)
       (conn pos6-1 pos5-1)
       (conn pos6-1 pos6-0)
       (conn pos6-2 pos7-2)
       (conn pos6-2 pos6-3)
       (conn pos6-2 pos5-2)
       (conn pos6-2 pos6-1)
       (conn pos6-3 pos7-3)
       (conn pos6-3 pos6-4)
       (conn pos6-3 pos5-3)
       (conn pos6-3 pos6-2)
       (conn pos6-4 pos7-4)
       (conn pos6-4 pos6-5)
       (conn pos6-4 pos5-4)
       (conn pos6-4 pos6-3)
       (conn pos6-5 pos7-5)
       (conn pos6-5 pos6-6)
       (conn pos6-5 pos5-5)
       (conn pos6-5 pos6-4)
       (conn pos6-6 pos7-6)
       (conn pos6-6 pos6-7)
       (conn pos6-6 pos5-6)
       (conn pos6-6 pos6-5)
       (conn pos6-7 pos7-7)
       (conn pos6-7 pos6-8)
       (conn pos6-7 pos5-7)
       (conn pos6-7 pos6-6)
       (conn pos6-8 pos7-8)
       (conn pos6-8 pos5-8)
       (conn pos6-8 pos6-7)
       (conn pos7-0 pos8-0)
       (conn pos7-0 pos7-1)
       (conn pos7-0 pos6-0)
       (conn pos7-1 pos8-1)
       (conn pos7-1 pos7-2)
       (conn pos7-1 pos6-1)
       (conn pos7-1 pos7-0)
       (conn pos7-2 pos8-2)
       (conn pos7-2 pos7-3)
       (conn pos7-2 pos6-2)
       (conn pos7-2 pos7-1)
       (conn pos7-3 pos8-3)
       (conn pos7-3 pos7-4)
       (conn pos7-3 pos6-3)
       (conn pos7-3 pos7-2)
       (conn pos7-4 pos8-4)
       (conn pos7-4 pos7-5)
       (conn pos7-4 pos6-4)
       (conn pos7-4 pos7-3)
       (conn pos7-5 pos8-5)
       (conn pos7-5 pos7-6)
       (conn pos7-5 pos6-5)
       (conn pos7-5 pos7-4)
       (conn pos7-6 pos8-6)
       (conn pos7-6 pos7-7)
       (conn pos7-6 pos6-6)
       (conn pos7-6 pos7-5)
       (conn pos7-7 pos8-7)
       (conn pos7-7 pos7-8)
       (conn pos7-7 pos6-7)
       (conn pos7-7 pos7-6)
       (conn pos7-8 pos8-8)
       (conn pos7-8 pos6-8)
       (conn pos7-8 pos7-7)
       (conn pos8-0 pos8-1)
       (conn pos8-0 pos7-0)
       (conn pos8-1 pos8-2)
       (conn pos8-1 pos7-1)
       (conn pos8-1 pos8-0)
       (conn pos8-2 pos8-3)
       (conn pos8-2 pos7-2)
       (conn pos8-2 pos8-1)
       (conn pos8-3 pos8-4)
       (conn pos8-3 pos7-3)
       (conn pos8-3 pos8-2)
       (conn pos8-4 pos8-5)
       (conn pos8-4 pos7-4)
       (conn pos8-4 pos8-3)
       (conn pos8-5 pos8-6)
       (conn pos8-5 pos7-5)
       (conn pos8-5 pos8-4)
       (conn pos8-6 pos8-7)
       (conn pos8-6 pos7-6)
       (conn pos8-6 pos8-5)
       (conn pos8-7 pos8-8)
       (conn pos8-7 pos7-7)
       (conn pos8-7 pos8-6)
       (conn pos8-8 pos7-8)
       (conn pos8-8 pos8-7)
       (locked pos0-4)
       (locked pos4-2)
       (locked pos3-5)
       (locked pos0-8)
       (lock-shape  pos0-4 shape0)
       (lock-shape  pos4-2 shape1)
       (lock-shape  pos3-5 shape1)
       (lock-shape  pos0-8 shape1)
       (open pos0-0)
       (open pos0-1)
       (open pos0-2)
       (open pos0-3)
       (open pos0-5)
       (open pos0-6)
       (open pos0-7)
       (open pos1-0)
       (open pos1-1)
       (open pos1-2)
       (open pos1-3)
       (open pos1-4)
       (open pos1-5)
       (open pos1-6)
       (open pos1-7)
       (open pos1-8)
       (open pos2-0)
       (open pos2-1)
       (open pos2-2)
       (open pos2-3)
       (open pos2-4)
       (open pos2-5)
       (open pos2-6)
       (open pos2-7)
       (open pos2-8)
       (open pos3-0)
       (open pos3-1)
       (open pos3-2)
       (open pos3-3)
       (open pos3-4)
       (open pos3-6)
       (open pos3-7)
       (open pos3-8)
       (open pos4-0)
       (open pos4-1)
       (open pos4-3)
       (open pos4-4)
       (open pos4-5)
       (open pos4-6)
       (open pos4-7)
       (open pos4-8)
       (open pos5-0)
       (open pos5-1)
       (open pos5-2)
       (open pos5-3)
       (open pos5-4)
       (open pos5-5)
       (open pos5-6)
       (open pos5-7)
       (open pos5-8)
       (open pos6-0)
       (open pos6-1)
       (open pos6-2)
       (open pos6-3)
       (open pos6-4)
       (open pos6-5)
       (open pos6-6)
       (open pos6-7)
       (open pos6-8)
       (open pos7-0)
       (open pos7-1)
       (open pos7-2)
       (open pos7-3)
       (open pos7-4)
       (open pos7-5)
       (open pos7-6)
       (open pos7-7)
       (open pos7-8)
       (open pos8-0)
       (open pos8-1)
       (open pos8-2)
       (open pos8-3)
       (open pos8-4)
       (open pos8-5)
       (open pos8-6)
       (open pos8-7)
       (open pos8-8)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape1)
       (key-shape  key3 shape0)
       (at key0 pos0-2)
       (at key1 pos0-4)
       (at key2 pos6-4)
       (at key3 pos6-2)
       (at-robot pos8-4)
    )

    (:goal (and
       (at key0 pos5-6)
       (at key1 pos3-2)
       (at key2 pos1-7)
       (at key3 pos2-2)
    )))

; plan
1. (move pos8-4 pos7-4)
   deleted: (at-robot pos8-4)
   added: (at-robot pos7-4)
   goals met: 0 of 4
2. (move pos7-4 pos6-4)
   deleted: (at-robot pos7-4)
   added: (at-robot pos6-4)
   goals met: 0 of 4
3. (move pos6-4 pos6-3)
   deleted: (at-robot pos6-4)
   added: (at-robot pos6-3)
   goals met: 0 of 4
4. (move pos6-3 pos6-2)
   deleted: (at-robot pos6-3)
   added: (at-robot pos6-2)
   goals met: 0 of 4
5. (pickup pos6-2 key3)
   deleted: (at key3 pos6-2) (arm-empty)
   added: (holding key3)
   goals met: 0 of 4
6. (move pos6-2 pos6-3)
   deleted: (at-robot pos6-2)
   added: (at-robot pos6-3)
   goals met: 0 of 4
7. (move pos6-3 pos5-3)
   deleted: (at-robot pos6-3)
   added: (at-robot pos5-3)
   goals met: 0 of 4
8. (move pos5-3 pos4-3)
   deleted: (at-robot pos5-3)
   added: (at-robot pos4-3)
   goals met: 0 of 4
9. (move pos4-3 pos3-3)
   deleted: (at-robot pos4-3)
   added: (at-robot pos3-3)
   goals met: 0 of 4
10. (move pos3-3 pos3-2)
   deleted: (at-robot pos3-3)
   added: (at-robot pos3-2)
   goals met: 0 of 4
11. (putdown pos3-2 key3)
   deleted: (holding key3)
   added: (arm-empty) (at key3 pos3-2)
   goals met: 0 of 4
12. (move pos3-2 pos3-3)
   deleted: (at-robot pos3-2)
   added: (at-robot pos3-3)
   goals met: 0 of 4
13. (move pos3-3 pos3-4)
   deleted: (at-robot pos3-3)
   added: (at-robot pos3-4)
   goals met: 0 of 4
14. (move pos3-4 pos4-4)
   deleted: (at-robot pos3-4)
   added: (at-robot pos4-4)
   goals met: 0 of 4
15. (move pos4-4 pos5-4)
   deleted: (at-robot pos4-4)
   added: (at-robot pos5-4)
   goals met: 0 of 4
16. (move pos5-4 pos6-4)
   deleted: (at-robot pos5-4)
   added: (at-robot pos6-4)
   goals met: 0 of 4
17. (pickup pos6-4 key2)
   deleted: (at key2 pos6-4) (arm-empty)
   added: (holding key2)
   goals met: 0 of 4
18. (move pos6-4 pos5-4)
   deleted: (at-robot pos6-4)
   added: (at-robot pos5-4)
   goals met: 0 of 4
19. (move pos5-4 pos4-4)
   deleted: (at-robot pos5-4)
   added: (at-robot pos4-4)
   goals met: 0 of 4
20. (move pos4-4 pos3-4)
   deleted: (at-robot pos4-4)
   added: (at-robot pos3-4)
   goals met: 0 of 4
21. (move pos3-4 pos3-3)
   deleted: (at-robot pos3-4)
   added: (at-robot pos3-3)
   goals met: 0 of 4
22. (move pos3-3 pos3-2)
   deleted: (at-robot pos3-3)
   added: (at-robot pos3-2)
   goals met: 0 of 4
23. (pickup-and-loose pos3-2 key3 key2)
   deleted: (holding key2) (at key3 pos3-2)
   added: (holding key3) (at key2 pos3-2)
   goals met: 0 of 4
24. (move pos3-2 pos2-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos2-2)
   goals met: 0 of 4
25. (move pos2-2 pos1-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos1-2)
   goals met: 0 of 4
26. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 0 of 4
27. (move pos1-3 pos0-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos0-3)
   goals met: 0 of 4
28. (unlock pos0-3 pos0-4 key3 shape0)
   deleted: (locked pos0-4)
   added: (open pos0-4)
   goals met: 0 of 4
29. (move pos0-3 pos1-3)
   deleted: (at-robot pos0-3)
   added: (at-robot pos1-3)
   goals met: 0 of 4
30. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 0 of 4
31. (move pos1-2 pos2-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos2-2)
   goals met: 0 of 4
32. (putdown pos2-2 key3)
   deleted: (holding key3)
   added: (arm-empty) (at key3 pos2-2)
   goals met: 1 of 4
33. (move pos2-2 pos1-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos1-2)
   goals met: 1 of 4
34. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 1 of 4
35. (move pos1-3 pos0-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos0-3)
   goals met: 1 of 4
36. (move pos0-3 pos0-2)
   deleted: (at-robot pos0-3)
   added: (at-robot pos0-2)
   goals met: 1 of 4
37. (pickup pos0-2 key0)
   deleted: (at key0 pos0-2) (arm-empty)
   added: (holding key0)
   goals met: 1 of 4
38. (move pos0-2 pos1-2)
   deleted: (at-robot pos0-2)
   added: (at-robot pos1-2)
   goals met: 1 of 4
39. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 1 of 4
40. (move pos1-3 pos1-4)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-4)
   goals met: 1 of 4
41. (putdown pos1-4 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos1-4)
   goals met: 1 of 4
42. (move pos1-4 pos0-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos0-4)
   goals met: 1 of 4
43. (pickup pos0-4 key1)
   deleted: (at key1 pos0-4) (arm-empty)
   added: (holding key1)
   goals met: 1 of 4
44. (move pos0-4 pos1-4)
   deleted: (at-robot pos0-4)
   added: (at-robot pos1-4)
   goals met: 1 of 4
45. (move pos1-4 pos1-3)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-3)
   goals met: 1 of 4
46. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 1 of 4
47. (move pos1-2 pos2-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos2-2)
   goals met: 1 of 4
48. (move pos2-2 pos3-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos3-2)
   goals met: 1 of 4
49. (pickup-and-loose pos3-2 key2 key1)
   deleted: (holding key1) (at key2 pos3-2)
   added: (holding key2) (at key1 pos3-2)
   goals met: 2 of 4
50. (move pos3-2 pos3-3)
   deleted: (at-robot pos3-2)
   added: (at-robot pos3-3)
   goals met: 2 of 4
51. (move pos3-3 pos3-4)
   deleted: (at-robot pos3-3)
   added: (at-robot pos3-4)
   goals met: 2 of 4
52. (move pos3-4 pos2-4)
   deleted: (at-robot pos3-4)
   added: (at-robot pos2-4)
   goals met: 2 of 4
53. (move pos2-4 pos1-4)
   deleted: (at-robot pos2-4)
   added: (at-robot pos1-4)
   goals met: 2 of 4
54. (move pos1-4 pos1-5)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-5)
   goals met: 2 of 4
55. (move pos1-5 pos1-6)
   deleted: (at-robot pos1-5)
   added: (at-robot pos1-6)
   goals met: 2 of 4
56. (move pos1-6 pos1-7)
   deleted: (at-robot pos1-6)
   added: (at-robot pos1-7)
   goals met: 2 of 4
57. (putdown pos1-7 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos1-7)
   goals met: 3 of 4
58. (move pos1-7 pos1-6)
   deleted: (at-robot pos1-7)
   added: (at-robot pos1-6)
   goals met: 3 of 4
59. (move pos1-6 pos1-5)
   deleted: (at-robot pos1-6)
   added: (at-robot pos1-5)
   goals met: 3 of 4
60. (move pos1-5 pos1-4)
   deleted: (at-robot pos1-5)
   added: (at-robot pos1-4)
   goals met: 3 of 4
61. (pickup pos1-4 key0)
   deleted: (at key0 pos1-4) (arm-empty)
   added: (holding key0)
   goals met: 3 of 4
62. (move pos1-4 pos1-5)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-5)
   goals met: 3 of 4
63. (move pos1-5 pos1-6)
   deleted: (at-robot pos1-5)
   added: (at-robot pos1-6)
   goals met: 3 of 4
64. (move pos1-6 pos2-6)
   deleted: (at-robot pos1-6)
   added: (at-robot pos2-6)
   goals met: 3 of 4
65. (move pos2-6 pos3-6)
   deleted: (at-robot pos2-6)
   added: (at-robot pos3-6)
   goals met: 3 of 4
66. (move pos3-6 pos4-6)
   deleted: (at-robot pos3-6)
   added: (at-robot pos4-6)
   goals met: 3 of 4
67. (move pos4-6 pos5-6)
   deleted: (at-robot pos4-6)
   added: (at-robot pos5-6)
   goals met: 3 of 4
68. (putdown pos5-6 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos5-6)
   goals met: 4 of 4
